//У вас есть список имен: Alice, Bob, John.
//Вывести его в прямом порядке.
//Сдать до конца завтрашнего дня.


package com.blockwit.learn1.romannau;

public class Task3 {
    public static void main(String[] args) {
        String[] Names = new String[] {"Alice", "Bob", "John"};
        for (int i=0; i<3; i++) {
            System.out.println(Names[i]);
        }
    }
}
